Repository: WhiteWolfDD/tg-market-bot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: et, ru

source: 🚫 Unsupported media type.
et: 🚫 Toetuseta meediatüüp.
ru: 🚫 Неподдерживаемый тип медиа.

source: 🚫 The file size must be less than 45 MB.
et: 🚫 Faili suurus peab olema väiksem kui 45 MB.
ru: 🚫 Размер файла должен быть менее 45 МБ.

source: 🚫 You can only upload up to 10 media files.
et: 🚫 Saate üles laadida kuni 10 meediafaili.
ru: 🚫 Вы можете загрузить только до 10 медиафайлов.

source: ✅ Finish
et: ✅ Lõpeta
ru: ✅ Завершить

source: 📤 File uploaded. Do you want to add another media file?
et: 📤 Fail on üles laaditud. Kas soovite lisada veel meediafaili?
ru: 📤 Файл загружен. Хотите добавить еще один медиафайл?

source: ➕ Add more
et: ➕ Lisa veel
ru: ➕ Добавить еще

source: 🚫 Invalid state.
et: 🚫 Vigane olek.
ru: 🚫 Неверное состояние.

source: 📤 Send the next media file (photo, video, document).
et: 📤 Saatke järgmine meediafail (foto, video, dokument).
ru: 📤 Отправьте следующий медиафайл (фото, видео, документ).

source: 🚫 No media files found.
et: 🚫 Meediafaile ei leitud.
ru: 🚫 Медиафайлы не найдены.

source: ✅ Media files have been successfully updated.
et: ✅ Meediafailid on edukalt uuendatud.
ru: ✅ Медиафайлы успешно обновлены.

source: 📍 Share Location
et: 📍 Jaga asukohta
ru: 📍 Поделиться местоположением

source: 📍 Send me the *location* of the ad or type it manually.
et: 📍 Saatke mulle kuulutuse *asukoht* või sisestage see käsitsi.
ru: 📍 Отправьте мне *местоположение* объявления или введите его вручную.

source: 📤 Video is being uploaded to the server...
et: 📤 Video laaditakse serverisse üles...
ru: 📤 Видео загружается на сервер...

source: ✅ Video has been successfully uploaded to the server.
et: ✅ Video on edukalt serverisse üles laaditud.
ru: ✅ Видео успешно загружено на сервер.

source: *Title:* {ad_title} *Description:* {ad_description} *Reason for Selling:* {ad_reason} *Price:* {ad_price} € *Contact Information:* {ad_contact_info} *Location:* {ad_location} {hashtags}
et: *Pealkiri:* {ad_title} *Kirjeldus:* {ad_description} *Müügi põhjus:* {ad_reason} *Hind:* {ad_price} € *Kontaktandmed:* {ad_contact_info} *Asukoht:* {ad_location} {hashtags}
ru: *Название:* {ad_title} *Описание:* {ad_description} *Причина продажи:* {ad_reason} *Цена:* {ad_price} € *Контактная информация:* {ad_contact_info} *Местоположение:* {ad_location} {hashtags}

source: 🗑 Delete
et: 🗑 Kustuta
ru: 🗑 Удалить

source: ✏️ Edit
et: ✏️ Muuda
ru: ✏️ Редактировать

source: 🎟 Please manage this ad:
et: 🎟 Palun haldage seda kuulutust:
ru: 🎟 Пожалуйста, управляйте этим объявлением:

source: 😕 *Oops!* Something went wrong while processing your request. Please try again later. Our team has been notified about this error.
et: 😕 *Ups!* Midagi läks valesti teie päringu töötlemisel. Palun proovige hiljem uuesti. Meie meeskond on selle vea kohta teavitatud.
ru: 😕 *Упс!* Что-то пошло не так при обработке вашего запроса. Пожалуйста, попробуйте позже. Наша команда уведомлена об этой ошибке.

source: 💥 *A new error has occurred!* Exception log is attached below.
et: 💥 *Uus viga on ilmnenud!* Erindlogi on allpool manustatud.
ru: 💥 *Произошла новая ошибка!* Лог исключения прикреплен ниже.

source: ✅ Your ad has been approved and posted in the channel.
et: ✅ Teie kuulutus on heaks kiidetud ja postitatud kanalisse.
ru: ✅ Ваше объявление одобрено и размещено в канале.

source: ✅ Advertisement approved.
et: ✅ Kuulutus on heaks kiidetud.
ru: ✅ Объявление одобрено.

source: 🚫 Error while posting ad to channel.
et: 🚫 Viga kuulutuse kanalisse postitamisel.
ru: 🚫 Ошибка при размещении объявления в канале.

source: ❌ Advertisement rejected.
et: ❌ Kuulutus on tagasi lükatud.
ru: ❌ Объявление отклонено.

source: 🚫 Cannot find the user.
et: 🚫 Kasutajat ei leitud.
ru: 🚫 Не удалось найти пользователя.

source: *Title:* {advertisement_title} *Description:* {advertisement_description} *Reason for Selling:* {advertisement_reason} *Price:* {advertisement_price} € *Contact Information:* {advertisement_contact_info} *Location:* {advertisement_location} {hashtags}
et: *Pealkiri:* {advertisement_title} *Kirjeldus:* {advertisement_description} *Müügi põhjus:* {advertisement_reason} *Hind:* {advertisement_price} € *Kontaktandmed:* {advertisement_contact_info} *Asukoht:* {advertisement_location} {hashtags}
ru: *Название:* {advertisement_title} *Описание:* {advertisement_description} *Причина продажи:* {advertisement_reason} *Цена:* {advertisement_price} € *Контактная информация:* {advertisement_contact_info} *Местоположение:* {advertisement_location} {hashtags}

source: 🚫 Operation canceled.
et: 🚫 Tegevus tühistatud.
ru: 🚫 Операция отменена.

source: 📤 *Post an ad* 📝 Send me the *title* of the ad. ✍️ e.g. iPhone 16 Pro Max 🚫 Send /cancel to cancel the operation.
et: 📤 *Avalda kuulutus* 📝 Saada mulle kuulutuse *pealkiri*. ✍️ nt. iPhone 16 Pro Max 🚫 Saada /cancel, et tegevus katkestada.
ru: 📤 *Разместить объявление* 📝 Отправьте мне *название* объявления. ✍️ например, iPhone 16 Pro Max 🚫 Отправьте /cancel, чтобы отменить операцию.

source: 📤 *Post an ad* 📝 Send me the *description* of the ad. ✍️ e.g. Brand new iPhone 16 Pro Max with 512GB. 🚫 Send /cancel to cancel the operation.
et: 📤 *Avalda kuulutus* 📝 Saada mulle kuulutuse *kirjeldus*. ✍️ nt. Täiesti uus iPhone 16 Pro Max 512GB-ga. 🚫 Saada /cancel, et tegevus katkestada.
ru: 📤 *Разместить объявление* 📝 Отправьте мне *описание* объявления. ✍️ например, совершенно новый iPhone 16 Pro Max с 512 ГБ. 🚫 Отправьте /cancel, чтобы отменить операцию.

source: 📤 *Post an ad* 📝 Please provide the *reason for selling*. ✍️ e.g. I need money for my tuition fees. 🚫 Send /cancel to cancel the operation.
et: 📤 *Avalda kuulutus* 📝 Palun andke teada *müügi põhjus*. ✍️ nt. Vajan raha õppemaksu jaoks. 🚫 Saada /cancel, et tegevus katkestada.
ru: 📤 *Разместить объявление* 📝 Пожалуйста, укажите *причину продажи*. ✍️ например, мне нужны деньги на обучение. 🚫 Отправьте /cancel, чтобы отменить операцию.

source: 📤 *Post an ad* 💵 Send me the *price* of the ad in euro. ✍️ e.g. 699.99 🚫 Send /cancel to cancel the operation.
et: 📤 *Avalda kuulutus* 💵 Saada mulle kuulutuse *hind* eurodes. ✍️ nt. 699.99 🚫 Saada /cancel, et tegevus katkestada.
ru: 📤 *Разместить объявление* 💵 Отправьте мне *цена* объявления в евро. ✍️ например, 699.99 🚫 Отправьте /cancel, чтобы отменить операцию.

source: 💵 Please enter a valid price with 2 decimal places.
et: 💵 Palun sisestage kehtiv hind kahe kümnendkohaga.
ru: 💵 Пожалуйста, введите корректную цену с 2 десятичными знаками.

source: 📎 Send me the *contact information* of the ad.
et: 📎 Saada mulle kuulutuse *kontaktandmed*.
ru: 📎 Отправьте мне *контактную информацию* объявления.

source: 📤 *Post an ad* ☕️ *Please wait while I process your ad...*
et: 📤 *Avalda kuulutus* ☕️ *Palun oodake, kuni ma teie kuulutust töötlen...*
ru: 📤 *Разместить объявление* ☕️ *Пожалуйста, подождите, пока я обрабатываю ваше объявление...*

source: *Title:* {title} *Description:* {description} *Reason for Selling:* {reason} *Price:* {price} € *Contact Information:* {contact_info} *Location:* {location_text} {hashtags_text}
et: *Pealkiri:* {title} *Kirjeldus:* {description} *Müügi põhjus:* {reason} *Hind:* {price} € *Kontaktandmed:* {contact_info} *Asukoht:* {location_text} {hashtags_text}
ru: *Название:* {title} *Описание:* {description} *Причина продажи:* {reason} *Цена:* {price} € *Контактная информация:* {contact_info} *Местоположение:* {location_text} {hashtags_text}

source: 📤 *Post an ad* 👍 *Please confirm the details of your ad.*
et: 📤 *Avalda kuulutus* 👍 *Palun kinnitage oma kuulutuse üksikasjad.*

source: ✅ Confirm
et: ✅ Kinnita

source: 🚫 Cancel
et: 🚫 Tühista

source: 📤 *Post an ad* 👍 Your ad has been *successfully submitted for moderation*. 🔍 You can check the *status* of your ad through the "My Ads" button in the ReplyKeyboard when you use the /start command. ✅ If your ad *passes the moderation*, it will be *posted in the group* and you will be *notified immediately*. ❌ If your ad *does not pass* the moderation, *you will be notified* as well.
et: 📤 *Avalda kuulutus* 👍 Teie kuulutus on *edukalt saadetud modereerimisele*. 🔍 Saate kontrollida oma kuulutuse *olekut* nupu "Minu kuulutused" kaudu, kui kasutate käsku /start. ✅ Kui teie kuulutus *läbib modereerimise*, siis see *postitatakse gruppi* ja teid *teavitatakse kohe*. ❌ Kui teie kuulutus *ei läbi* modereerimist, siis *teid teavitatakse* samuti.
ru: 📤 *Разместить объявление* 👍 Ваше объявление было *успешно отправлено на модерацию*. 🔍 Вы можете проверить *статус* вашего объявления через кнопку "Мои объявления" на клавиатуре ответа при использовании команды /start. ✅ Если ваше объявление *пройдет модерацию*, оно будет *размещено в группе* и вы будете *уведомлены немедленно*. ❌ Если ваше объявление *не пройдет* модерацию, *вам также будет сообщено*.

source: 🚫 *Ad Submission Canceled* Your ad submission has been *canceled*. To submit a new ad, please start the process again by selecting the "📤 Post an ad" button in the main menu. We look forward to seeing your ad soon! 😊
et: 🚫 *Kuulutuse esitamine tühistatud* Teie kuulutuse esitamine on *tühistatud*. Uue kuulutuse esitamiseks alustage protsessi uuesti, valides põhimenüüst nupu "📤 Avalda kuulutus". Ootame teie kuulutust varsti! 😊
ru: 🚫 *Отмена подачи объявления* Ваша подача объявления была *отменена*. Чтобы подать новое объявление, пожалуйста, начните процесс заново, выбрав кнопку "📤 Разместить объявление" в главном меню. Мы с нетерпением ждем вашего объявления! 😊

source: Unknown location
et: Teadmata asukoht
ru: Неизвестное местоположение

source: ✅ Approve
et: ✅ Kinnita
ru: ✅ Одобрить

source: 🔧 Manage
et: 🔧 Halda
ru: 🔧 Управлять

source: ❌ Reject
et: ❌ Lükka tagasi
ru: ❌ Отклонить

source: 🎟 Please approve or reject this ad:
et: 🎟 Palun kinnitage või lükake tagasi see kuulutus:
ru: 🎟 Пожалуйста, одобрите или отклоните это объявление:

source: No categories found.
et: Kategooriaid ei leitud.
ru: Категории не найдены.

source: 🔍 Search categories
et: 🔍 Otsi kategooriaid
ru: 🔍 Поиск категорий

source: Please select a category:
et: Palun valige kategooria:
ru: Пожалуйста, выберите категорию:

source: Category not found.
et: Kategooriat ei leitud.
ru: Категория не найдена.

source: ➡️ Go to child categories
et: ➡️ Mine alamkategooriatesse
ru: ➡️ Перейти к подкатегориям

source: ✅ Confirm category (Don't use in Category Edit)
et: ✅ Kinnita kategooria (Ära kasuta kategooria muutmisel)
ru: ✅ Подтвердить категорию (Не используйте при редактировании категории)

source: 🔄 Toggle category status
et: 🔄 Muuda kategooria staatust
ru: 🔄 Переключить статус категории

source: ❌ Cancel
et: ❌ Tühista
ru: ❌ Отмена

source: You have selected the category: {category_name} Choose an action:
et: Olete valinud kategooria: {category_name} Valige tegevus:
ru: Вы выбрали категорию: {category_name} Выберите действие:

source: You have selected the category: {category_name} ✅ Confirm your selection:
et: Olete valinud kategooria: {category_name} ✅ Kinnitage oma valik:
ru: Вы выбрали категорию: {category_name} ✅ Подтвердите свой выбор:

source: ⏳ Processing, please wait... It may take a while.
et: ⏳ Töötlemine, palun oodake... See võib võtta aega.
ru: ⏳ Обработка, пожалуйста, подождите... Это может занять некоторое время.

source: Unknown action.
et: Teadmata tegevus.
ru: Неизвестное действие.

source: ✅ Category status updated.
et: ✅ Kategooria staatus on uuendatud.
ru: ✅ Статус категории обновлен.

source: An error occurred while updating the category status.
et: Viga kategooria staatuse uuendamisel.
ru: Произошла ошибка при обновлении статуса категории.

source: Action canceled.
et: Tegevus tühistatud.
ru: Действие отменено.

source: Please select a category first.
et: Palun valige esmalt kategooria.
ru: Пожалуйста, сначала выберите категорию.

source: 📤 *Post an ad* 📸 Send me the *media* of the ad. ❗️ Limit per one file - *45 MB* 🚫 Send /cancel to cancel the operation.
et: 📤 *Avalda kuulutus* 📸 Saada mulle kuulutuse *meedia*. ❗️ Ühe faili piirang - *45 MB* 🚫 Saada /cancel, et tegevus katkestada.
ru: 📤 *Разместить объявление* 📸 Отправьте мне *медиа* объявления. ❗️ Ограничение на один файл - *45 МБ* 🚫 Отправьте /cancel, чтобы отменить операцию.

source: Please enter your search query:
et: Palun sisestage oma otsingupäring:
ru: Пожалуйста, введите ваш поисковый запрос:

source: Please enter a valid search query.
et: Palun sisestage kehtiv otsingupäring.
ru: Пожалуйста, введите корректный поисковый запрос.

source: 🛠️ What field would you like to edit? Please choose an option below:
et: 🛠️ Millist välja soovite muuta? Palun valige allolevatest valikutest:
ru: 🛠️ Какое поле вы хотите изменить? Пожалуйста, выберите вариант ниже:

source: 📷 Please send me a new photo or video for this advertisement.
et: 📷 Palun saatke mulle selle kuulutuse uus foto või video.
ru: 📷 Пожалуйста, отправьте мне новое фото или видео для этого объявления.

source: 📝 Please send me a new title for this advertisement.
et: 📝 Palun saatke mulle selle kuulutuse uus pealkiri.
ru: 📝 Пожалуйста, отправьте мне новое название для этого объявления.

source: 📄 Please send me a new description for this advertisement.
et: 📄 Palun saatke mulle selle kuulutuse uus kirjeldus.
ru: 📄 Пожалуйста, отправьте мне новое описание для этого объявления.

source: 💰 Please send me a new price for this advertisement.
et: 💰 Palun saatke mulle selle kuulutuse uus hind.
ru: 💰 Пожалуйста, отправьте мне новую цену для этого объявления.

source: 📝 Please send me a new reason for selling this item.
et: 📝 Palun saatke mulle selle eseme müümise uus põhjus.
ru: 📝 Пожалуйста, отправьте мне новую причину продажи этого предмета.

source: 📞 Please send me new contact information for this advertisement.
et: 📞 Palun saatke mulle selle kuulutuse uued kontaktandmed.
ru: 📞 Пожалуйста, отправьте мне новую контактную информацию для этого объявления.

source: 📍 Please send me a new location for this advertisement.
et: 📍 Palun saatke mulle selle kuulutuse uus asukoht.
ru: 📍 Пожалуйста, отправьте мне новое местоположение для этого объявления.

source: 📦 Please send me a new category for this advertisement.
et: 📦 Palun saatke mulle selle kuulutuse uus kategooria.
ru: 📦 Пожалуйста, отправьте мне новую категорию для этого объявления.

source: 🔖 Please send me new hashtags for this advertisement.
et: 🔖 Palun saatke mulle selle kuulutuse uued hashtagid.
ru: 🔖 Пожалуйста, отправьте мне новые хэштеги для этого объявления.

source: Unknown field.
et: Teadmata väli.
ru: Неизвестное поле.

source: has been successfully updated.
et: on edukalt uuendatud.
ru: было успешно обновлено.

source: 🙇‍♂️ Failed to update the advertisement field.
et: 🙇‍♂️ Ei õnnestunud kuulutuse välja uuendada.
ru: 🙇‍♂️ Не удалось обновить поле объявления.

source: Please share your location.
et: Palun jagage oma asukohta.
ru: Пожалуйста, поделитесь своим местоположением.

source: 📍 Location has been successfully updated.
et: 📍 Asukoht on edukalt uuendatud.
ru: 📍 Местоположение успешно обновлено.

source: 🙇‍♂️ Failed to update the location.
et: 🙇‍♂️ Ei õnnestunud asukohta uuendada.
ru: 🙇‍♂️ Не удалось обновить местоположение.

source: 📜 *Error logs*. No logs found.
et: 📜 *Vigade logid*. Vigade logisid ei leitud.
ru: 📜 *Логи ошибок*. Логи не найдены.

source: 📜 *Error logs*. Select a log to view.
et: 📜 *Vigade logid*. Valige logi vaatamiseks.
ru: 📜 *Логи ошибок*. Выберите лог для просмотра.

source: ⬅️ Previous
et: ⬅️ Eelmine
ru: ⬅️ Предыдущий

source: ➡️ Next
et: ➡️ Järgmine
ru: ➡️ Следующий

source: 🗑 Delete all logs
et: 🗑 Kustuta kõik logid
ru: 🗑 Удалить все логи

source: 📜 *Error log*. Log file is attached below.
et: 📜 *Vigade logi*. Logifail on allolevalt manustatud.
ru: 📜 *Лог ошибки*. Файл лога прикреплен ниже.

source: 📜 No logs found.
et: 📜 Logisid ei leitud.
ru: 📜 Логи не найдены.

source: 📜 Log not found.
et: 📜 Logi ei leitud.
ru: 📜 Лог не найден.

source: ❕ *How to advertise on the platform?* 1️⃣ Click on the *"📤 Post an ad"* button in the main menu to start posting an ad. 2️⃣ Fill in the required fields: *title*, *description*, *price*, *category*, *location*. 3️⃣ Upload *photos* of the product you are selling. 4️⃣ Click on the *"📤 Post"* button to publish the ad. 5️⃣ Wait for the ad to be *approved* by the moderator. 6️⃣ Once the ad is approved, it will be available for viewing by other users.
et: ❕ *Kuidas reklaamida platvormil?* 1️⃣ Klõpsake põhimenüüs nupul *"📤 Avalda kuulutus"*, et alustada kuulutuse postitamist. 2️⃣ Täitke vajalikud väljad: *pealkiri*, *kirjeldus*, *hind*, *kategooria*, *asukoht*. 3️⃣ Laadige üles *toote fotod*, mida müüte. 4️⃣ Klõpsake kuulutuse postimiseks nupul *"📤 Post"*. 5️⃣ Oodake, kuni kuulutus on moderaatori poolt *heaks kiidetud*. 6️⃣ Kui kuulutus on heaks kiidetud, on see teiste kasutajate vaatamiseks saadaval.
ru: ❕ *Как разместить рекламу на платформе?* 1️⃣ Нажмите на кнопку *"📤 Разместить объявление"* в главном меню, чтобы начать размещение объявления. 2️⃣ Заполните обязательные поля: *название*, *описание*, *цена*, *категория*, *местоположение*. 3️⃣ Загрузите *фотографии* продаваемого товара. 4️⃣ Нажмите на кнопку *"📤 Разместить"*, чтобы опубликовать объявление. 5️⃣ Дождитесь, пока объявление будет *одобрено* модератором. 6️⃣ После одобрения объявление станет доступно для просмотра другими пользователями.

source: ❕ *What is the cost of advertising?* 🔹 The cost of advertising on the platform is *free*. 🔹 You can post an unlimited number of ads without any restrictions.
et: ❕ *Mis on reklaamimise maksumus?* 🔹 Reklaamimine platvormil on *tasuta*. 🔹 Võite postitada piiramatul arvu kuulutusi ilma piiranguteta.
ru: ❕ *Какова стоимость рекламы?* 🔹 Размещение рекламы на платформе *бесплатно*. 🔹 Вы можете размещать неограниченное количество объявлений без каких-либо ограничений.

source: ❕ *What we do with your ads?* 🔹 We *moderate* all ads before they are published on the platform. 🔹 We *check* the ad for compliance with the rules of the platform. 🔹 We *approve* the ad if it meets the requirements.
et: ❕ *Mida me teeme teie kuulutustega?* 🔹 Me *modereerime* kõik kuulutused enne nende avaldamist platvormil. 🔹 Me *kontrollime* kuulutuse vastavust platvormi reeglitele. 🔹 Me *heaks kiidame* kuulutuse, kui see vastab nõuetele.
ru: ❕ *Что мы делаем с вашими объявлениями?* 🔹 Мы *модерируем* все объявления перед их публикацией на платформе. 🔹 Мы *проверяем* объявление на соответствие правилам платформы. 🔹 Мы *одобряем* объявление, если оно соответствует требованиям.

source: 📚 *FAQ* 👇 Here you can find answers to frequently asked questions. 🔹 *How to advertise on the platform?* 🔹 *What is the cost of advertising?* 🔹 *What we do with your ads?* 👇 *Choose a question* to get an answer.
et: 📚 *Korduma kippuvad küsimused (FAQ)* 👇 Siit leiate vastused sageli esitatud küsimustele. 🔹 *Kuidas reklaamida platvormil?* 🔹 *Mis on reklaamimise maksumus?* 🔹 *Mida me teeme teie kuulutustega?* 👇 *Valige küsimus*, et saada vastus.
ru: 📚 *Часто задаваемые вопросы (FAQ)* 👇 Здесь вы можете найти ответы на часто задаваемые вопросы. 🔹 *Как разместить рекламу на платформе?* 🔹 *Какова стоимость рекламы?* 🔹 *Что мы делаем с вашими объявлениями?* 👇 *Выберите вопрос*, чтобы получить ответ.

source: 🔹 How to advertise on the platform?
et: 🔹 Kuidas reklaamida platvormil?
ru: 🔹 Как разместить рекламу на платформе?

source: 🔹 What is the cost of advertising?
et: 🔹 Mis on reklaamimise maksumus?
ru: 🔹 Какова стоимость рекламы?

source: 🔹 What we do with your ads?
et: 🔹 Mida me teeme teie kuulutustega?
ru: 🔹 Что мы делаем с вашими объявлениями?

source: 👋 Hello, *{username}*. I'm *Seller — curator of your ads*. 🌟 Here you can post your *ads* for *selling* your product.
et: 👋 Tere, *{username}*. Mina olen *Seller — teie kuulutuste haldaja*. 🌟 Siin saate postitada oma *kuulutusi* oma toote *müümiseks*.
ru: 👋 Привет, *{username}*. Я — *Seller — куратор ваших объявлений*. 🌟 Здесь вы можете размещать свои *объявления* для *продажи* вашего продукта.

source: 📤 Post an ad
et: 📤 Avalda kuulutus
ru: 📤 Разместить объявление

source: 📦 My ads
et: 📦 Minu kuulutused
ru: 📦 Мои объявления

source: 🌐 Language
et: 🌐 Keel
ru: 🌐 Язык

source: 📦 Requested ads
et: 📦 Taotletud kuulutused
ru: 📦 Запрошенные объявления

source: 📜 Error logs
et: 📜 Vigade logid
ru: 📜 Логи ошибок

source: 📝 Manage Categories
et: 📝 Halda kategooriaid
ru: 📝 Управление категориями

source: 📊 Statistics
et: 📊 Statistika
ru: 📊 Статистика

source: ❌ You do not have access to this command.
et: ❌ Teil pole selle käsu kasutamiseks luba.
ru: ❌ У вас нет доступа к этой команде.

source: 🌐 *Select your language*
et: 🌐 *Valige oma keel*
ru: 🌐 *Выберите ваш язык*

source: 🌐 *Language successfully changed.* 🔄 Restarting the bot...
et: 🌐 *Keel on edukalt muudetud.* 🔄 Taaskäivitan boti...
ru: 🌐 *Язык успешно изменен.* 🔄 Перезапуск бота...

source: ❌ Advertisement not found.
et: ❌ Kuulutust ei leitud.
ru: ❌ Объявление не найдено.

source: 🎟 Please choose an action for this ad:
et: 🎟 Palun valige tegevus selle kuulutuse jaoks:
ru: 🎟 Пожалуйста, выберите действие для этого объявления:

source: ❌ Invalid callback data.
et: ❌ Vigane tagasilükkamise andmed.
ru: ❌ Неверные данные обратного вызова.

source: ❌ Invalid advertisement ID.
et: ❌ Vigane kuulutuse ID.
ru: ❌ Неверный ID объявления.

source: 🔧 What would you like to do with this advertisement?
et: 🔧 Mida soovite selle kuulutusega teha?
ru: 🔧 Что вы хотите сделать с этим объявлением?

source: ❌ Delete
et: ❌ Kustuta
ru: ❌ Удалить

source: 📊 *Bot Statistics:* 👥 Total users: {total_users} 🆕 New users today: {new_users_today} 🟢 Active users: {active_users} 📄 Total advertisements: {total_advertisements} 📈 Active advertisements: {active_advertisements} ✅ Approved advertisements: {successful_advertisements} ❌ Deleted advertisements: {deleted_advertisements} 📁 Total categories: {total_categories} 🔥 Popular categories: {popular_categories_text} ⏱ Average response time: {response_time_avg:.2f} seconds
et: 📊 *Boti statistika:* 👥 Kokku kasutajaid: {total_users} 🆕 Uusi kasutajaid täna: {new_users_today} 🟢 Aktiivseid kasutajaid: {active_users} 📄 Kokku kuulutusi: {total_advertisements} 📈 Aktiivseid kuulutusi: {active_advertisements} ✅ Heaks kiidetud kuulutusi: {successful_advertisements} ❌ Kustutatud kuulutusi: {deleted_advertisements} 📁 Kokku kategooriaid: {total_categories} 🔥 Populaarsed kategooriad: {popular_categories_text} ⏱ Keskmise vastusaja: {response_time_avg:.2f} sekundit
ru: 📊 *Статистика бота:* 👥 Всего пользователей: {total_users} 🆕 Новых пользователей сегодня: {new_users_today} 🟢 Активных пользователей: {active_users} 📄 Всего объявлений: {total_advertisements} 📈 Активных объявлений: {active_advertisements} ✅ Одобренных объявлений: {successful_advertisements} ❌ Удаленных объявлений: {deleted_advertisements} 📁 Всего категорий: {total_categories} 🔥 Популярные категории: {popular_categories_text} ⏱ Среднее время ответа: {response_time_avg:.2f} секунд

source: 📦 *Your ads*. Select a category to view your ads.
et: 📦 *Teie kuulutused*. Valige kategooria, et vaadata oma kuulutusi.
ru: 📦 *Ваши объявления*. Выберите категорию, чтобы просмотреть ваши объявления.

source: 🟢 Approved ads
et: 🟢 Heaks kiidetud kuulutused
ru: 🟢 Одобренные объявления

source: 🟡 Pending ads
et: 🟡 Ootel kuulutused
ru: 🟡 Ожидающие объявления

source: 🔴 Rejected ads
et: 🔴 Tagasi lükatud kuulutused
ru: 🔴 Отклоненные объявления

source: 🫢 No ads found in this category.
et: 🫢 Selles kategoorias ei leitud kuulutusi.
ru: 🫢 В этой категории объявлений не найдено.

source: Back
et: Tagasi
ru: Назад

source: 📦 *Your ads*. Select an advertisement to manage.
et: 📦 *Teie kuulutused*. Valige kuulutus haldamiseks.
ru: 📦 *Ваши объявления*. Выберите объявление для управления.

source: Ad deleted.
et: Kuulutus kustutatud.
ru: Объявление удалено.

source: The {field} should match the pattern '{pattern}'
et: {field} peaks vastama mustrile '{pattern}'
ru: Поле {field} должно соответствовать шаблону '{pattern}'
