Repository: WhiteWolfDD/tg-market-bot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: et, ru

source: The {field} field has an invalid value.
et: {field} väli sisaldab vigast väärtust.
ru: Поле {field} содержит неверное значение.

source: The {field} field must be greater than {limit_value}
et: {field} väli peab olema suurem kui {limit_value}
ru: Поле {field} должно быть больше {limit_value}

source: Error:
et: Viga:
ru: Ошибка:

source: Title cannot be empty or whitespace-only.
et: Pealkiri ei tohi olla tühi või ainult tühikud.
ru: Название не может быть пустым или состоять только из пробелов.

source: Title contains invalid characters.
et: Pealkirjas on vigaseid märke.
ru: Название содержит недопустимые символы.

source: Description cannot be empty or whitespace-only.
et: Kirjeldus ei tohi olla tühi või ainult tühikud.
ru: Описание не может быть пустым или состоять только из пробелов.

source: Description contains invalid characters.
et: Kirjelduses on vigaseid märke.
ru: Описание содержит недопустимые символы.

source: Reason cannot be empty or whitespace-only.
et: Põhjus ei tohi olla tühi või ainult tühikud.
ru: Причина не может быть пустой или состоять только из пробелов.

source: Reason contains invalid characters.
et: Põhjus sisaldab vigaseid märke.
ru: Причина содержит недопустимые символы.

source: Price must be a decimal.
et: Hind peab olema kümnendmurd.
ru: Цена должна быть десятичным числом.

source: Price must be positive.
et: Hind peab olema positiivne.
ru: Цена должна быть положительной.

source: ⬅️ Prev
et: ⬅️ Eelmine
ru: ⬅️ Пред.

source: Next ➡️
et: Järgmine ➡️
ru: След. ➡️

source: ⬅️ Back
et: ⬅️ Tagasi
ru: ⬅️ Назад

source: 🏠 Home
et: 🏠 Kodu
ru: 🏠 Главная

source: 📷 Media
et: 📷 Meedia
ru: 📷 Медиа

source: 📝 Title
et: 📝 Pealkiri
ru: 📝 Название

source: 📄 Description
et: 📄 Kirjeldus
ru: 📄 Описание

source: 💡 Reason for Selling
et: 💡 Müümise põhjus
ru: 💡 Причина продажи

source: 💰 Price
et: 💰 Hind
ru: 💰 Цена

source: 📞 Contact Information
et: 📞 Kontaktandmed
ru: 📞 Контактная информация

source: 📍 Location
et: 📍 Asukoht
ru: 📍 Местоположение

source: 🏷️ Hashtags
et: 🏷️ Hashtagid
ru: 🏷️ Хэштеги

source: msg
ru: сообщение
